<a href="https://colab.research.google.com/github/sampath11/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module3-make-explanatory-visualizations/LS_DS_124_Sequence_your_narrative_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Sequence Your Narrative - Assignment

Today we will create a sequence of visualizations inspired by [Hans Rosling's 200 Countries, 200 Years, 4 Minutes](https://www.youtube.com/watch?v=jbkSRLYSojo).

Using this [data from Gapminder](https://github.com/open-numbers/ddf--gapminder--systema_globalis/):
- [Income Per Person (GDP Per Capital, Inflation Adjusted) by Geo & Time](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--income_per_person_gdppercapita_ppp_inflation_adjusted--by--geo--time.csv)
- [Life Expectancy (in Years) by Geo & Time](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--life_expectancy_years--by--geo--time.csv)
- [Population Totals, by Geo & Time](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--population_total--by--geo--time.csv)
- [Entities](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--entities--geo--country.csv)
- [Concepts](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--concepts.csv)

Objectives
- sequence multiple visualizations
- combine qualitative anecdotes with quantitative aggregates

Links
- [Hans Roslingâ€™s TED talks](https://www.ted.com/speakers/hans_rosling)
- [Spiralling global temperatures from 1850-2016](https://twitter.com/ed_hawkins/status/729753441459945474)
- "[The Pudding](https://pudding.cool/) explains ideas debated in culture with visual essays."
- [A Data Point Walks Into a Bar](https://lisacharlotterost.github.io/2016/12/27/datapoint-in-bar/): a thoughtful blog post about emotion and empathy in data storytelling

# ASSIGNMENT
 

1.   Replicate the Lesson Code
2.   Take it further by using the same gapminder dataset to create a sequence of visualizations that combined tell a story of your choosing.

Get creative! Use text annotations to call out specific countries, maybe: change how the points are colored, change the opacity of the points, change their sized, pick a specific time window. Maybe only work with a subset of countries, change fonts, change background colors, etc. make it your own!

In [0]:
# TODO


#!pip install --upgrade seaborn

In [1]:


import seaborn as sns
sns.__version__

'0.9.0'

In [0]:

%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [0]:
income = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--income_per_person_gdppercapita_ppp_inflation_adjusted--by--geo--time.csv')

In [0]:
lifespan = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--life_expectancy_years--by--geo--time.csv')

In [0]:
population = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--population_total--by--geo--time.csv')

In [0]:
entities = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--entities--geo--country.csv')

In [0]:
concepts = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--concepts.csv')

In [8]:
income.shape, lifespan.shape, population.shape, entities.shape, concepts.shape

((46513, 3), (44370, 3), (59297, 3), (273, 33), (590, 16))

In [9]:
income.head()

   geo  time  income_per_person_gdppercapita_ppp_inflation_adjusted
0  afg  1800                                                603
1  afg  1801                                                603
2  afg  1802                                                603
3  afg  1803                                                603
4  afg  1804                                                603

In [10]:
income.sample(10)

       geo  time  income_per_person_gdppercapita_ppp_inflation_adjusted
11347  dnk  1820                                               2088
41692  tls  2040                                                979
44262  uzb  1959                                               2195
32508  pan  2014                                              19872
22658  kwt  1804                                               1114
3037   bel  1945                                               5321
42746  tuv  1889                                                911
17234  guy  1923                                               2652
43154  uga  1815                                                465
17854  hti  1820                                                635

In [11]:
lifespan.head()

   geo  time  life_expectancy_years
0  abw  1800                  34.42
1  abw  1801                  34.42
2  abw  1802                  34.42
3  abw  1803                  34.42
4  abw  1804                  34.42

In [12]:
lifespan.sample(10)

       geo  time  life_expectancy_years
40906  tza  1840                  32.20
14583  gin  1884                  31.35
8793   com  1835                  32.10
14761  glp  1843                  27.66
8731   col  1992                  71.13
30309  npl  1973                  49.94
586    ago  1948                  35.85
2219   aus  1947                  68.89
10891  dom  1915                  31.39
35365  sgp  1992                  76.56

In [13]:
population.head()

   geo  time  population_total
0  afg  1800           3280000
1  afg  1801           3280000
2  afg  1802           3280000
3  afg  1803           3280000
4  afg  1804           3280000

In [14]:
population.sample(10)

       geo  time  population_total
48604  ssd  1943           2490107
25649  ita  1864          26812516
23723  idn  2045         317731985
9629   chl  2098          18870247
22885  hti  1809            723000
50197  swe  2031          10761291
9729   chn  1897         394447899
2402   atg  2095            124162
22916  hti  1840            861220
44536  qat  2089           4046150

In [15]:
entities.head()

  country alt_5  ... world_4region        world_6region
0    abkh   NaN  ...        europe  europe_central_asia
1     abw   NaN  ...      americas              america
2     afg   NaN  ...          asia           south_asia
3     ago   NaN  ...        africa   sub_saharan_africa
4     aia   NaN  ...      americas              america

[5 rows x 33 columns]

In [17]:
concepts.head()

                                             concept  ...                        tags
0                  adults_with_hiv_percent_age_15_49  ...                         hiv
1                          age_at_1st_marriage_women  ...                  population
2                 aged_15_24_employment_rate_percent  ...             employment_rate
3               aged_15_24_unemployment_rate_percent  ...                unemployment
4  aged_15_64_labour_force_participation_rate_per...  ...  labour_force_participation

[5 rows x 16 columns]

In [18]:
df_1 = pd.DataFrame({'Student': ['Peter', 'Zach', 'Jane'], 'Math Test Score': [75, 89, 82]})
df_1

  Student  Math Test Score
0   Peter               75
1    Zach               89
2    Jane               82

In [19]:
df_2 = pd.DataFrame({'Student': ['Alice', 'Peter', 'Jane'], 'Biology Test Score': [78, 87, 90]})
df_2

  Student  Biology Test Score
0   Alice                  78
1   Peter                  87
2    Jane                  90

In [20]:
pd.merge(df_1, df_2, on='Student', how='right')

  Student  Math Test Score  Biology Test Score
0   Peter             75.0                  87
1    Jane             82.0                  90
2   Alice              NaN                  78

In [21]:
df_3 = pd.DataFrame({'Name': ['Alice', 'Andrew', 'Jane'], 
                     'Chemistry Test Scores': ['A', 'B', 'C']})
df_3

     Name Chemistry Test Scores
0   Alice                     A
1  Andrew                     B
2    Jane                     C

In [22]:
df_4 = pd.merge(df_2, df_3, left_on='Student', right_on='Name').drop(columns=['Student'])
df_4

   Biology Test Score   Name Chemistry Test Scores
0                  78  Alice                     A
1                  90   Jane                     C

In [23]:
income.shape

(46513, 3)

In [24]:
lifespan.shape

(44370, 3)

In [25]:
df = pd.merge(income, lifespan)
df.shape

(40437, 4)

In [26]:
df = pd.merge(income, lifespan, on=['geo', 'time'], how='inner')
df.shape

(40437, 4)

In [27]:
df.head()

   geo  ...  life_expectancy_years
0  afg  ...                  28.21
1  afg  ...                  28.20
2  afg  ...                  28.19
3  afg  ...                  28.18
4  afg  ...                  28.17

[5 rows x 4 columns]

In [28]:
df = pd.merge(df, population)
df.head()

   geo  time  ...  life_expectancy_years  population_total
0  afg  1800  ...                  28.21           3280000
1  afg  1801  ...                  28.20           3280000
2  afg  1802  ...                  28.19           3280000
3  afg  1803  ...                  28.18           3280000
4  afg  1804  ...                  28.17           3280000

[5 rows x 5 columns]

In [29]:
entities.head()

  country alt_5  ... world_4region        world_6region
0    abkh   NaN  ...        europe  europe_central_asia
1     abw   NaN  ...      americas              america
2     afg   NaN  ...          asia           south_asia
3     ago   NaN  ...        africa   sub_saharan_africa
4     aia   NaN  ...      americas              america

[5 rows x 33 columns]

In [31]:
subset_cols = ['country', 'name', 'world_4region', 'world_6region']
merged = pd.merge(df, entities[subset_cols], left_on='geo', right_on='country')
merged = merged.drop(columns=['geo'])
merged.head()

   time  ...  world_6region
0  1800  ...     south_asia
1  1801  ...     south_asia
2  1802  ...     south_asia
3  1803  ...     south_asia
4  1804  ...     south_asia

[5 rows x 8 columns]

In [32]:
mapping_1 = {
    'time': 'year',
    'country': 'country_code',
    'income_per_person_gdppercapita_ppp_inflation_adjusted': 'income',
    'population_total': 'population',
    'world_4region': '4region',
    'world_6region': '6region',
    'life_expectancy_years': 'lifespan'
}
mapping_2 = {'name': 'country'}
merged = merged.rename(columns=mapping_1)
merged = merged.rename(columns=mapping_2)
merged.head()

   year  income  lifespan  ...      country 4region     6region
0  1800     603     28.21  ...  Afghanistan    asia  south_asia
1  1801     603     28.20  ...  Afghanistan    asia  south_asia
2  1802     603     28.19  ...  Afghanistan    asia  south_asia
3  1803     603     28.18  ...  Afghanistan    asia  south_asia
4  1804     603     28.17  ...  Afghanistan    asia  south_asia

[5 rows x 8 columns]

In [33]:
merged.dtypes

year              int64
income            int64
lifespan        float64
population        int64
country_code     object
country          object
4region          object
6region          object
dtype: object

In [34]:
merged.describe()

               year         income      lifespan    population
count  40437.000000   40437.000000  40437.000000  4.043700e+04
mean    1909.292900    4619.492717     43.132080  1.371204e+07
std       63.308682   10209.571045     16.313228  6.606335e+07
min     1800.000000     247.000000      1.000000  2.128000e+03
25%     1854.000000     876.000000     31.160000  4.113310e+05
50%     1909.000000    1442.000000     35.500000  1.985952e+06
75%     1964.000000    3488.000000     55.970000  6.499707e+06
max     2018.000000  177522.000000     84.170000  1.415046e+09

In [35]:
merged.describe(exclude='number')

       country_code     country 4region              6region
count         40437       40437   40437                40437
unique          187         187       4                    6
top             khm  Montenegro  africa  europe_central_asia
freq            219         219   11826                10778

In [36]:
merged['country'].value_counts()

Montenegro                  219
Equatorial Guinea           219
Singapore                   219
Macedonia, FYR              219
Sierra Leone                219
Estonia                     219
Myanmar                     219
Uzbekistan                  219
Armenia                     219
Cape Verde                  219
Mozambique                  219
Trinidad and Tobago         219
Cambodia                    219
Uganda                      219
Chile                       219
Zimbabwe                    219
Belize                      219
Ireland                     219
Germany                     219
Kuwait                      219
Paraguay                    219
Argentina                   219
Mali                        219
Suriname                    219
Zambia                      219
Colombia                    219
Canada                      219
Malawi                      219
Georgia                     219
Namibia                     219
                           ...
Russia                      219
Gambia                      219
New Zealand                 219
Saudi Arabia                219
Bahrain                     219
Luxembourg                  219
Vanuatu                     219
Turkey                      219
Moldova                     219
Mauritania                  219
Nigeria                     219
Mexico                      219
Jamaica                     219
Honduras                    219
Liberia                     219
France                      219
Tonga                       219
Bangladesh                  219
Madagascar                  219
Benin                       219
Greece                      219
Central African Republic    219
Bulgaria                    219
Fiji                        219
Togo                        219
China                       219
Israel                      219
Andorra                      47
Dominica                     47
Marshall Islands             47
Name: country, Length: 187, dtype: int64

# STRETCH OPTIONS

## 1. Animate!

- [How to Create Animated Graphs in Python](https://towardsdatascience.com/how-to-create-animated-graphs-in-python-bb619cc2dec1)
- Try using [Plotly](https://plot.ly/python/animations/)!
- [The Ultimate Day of Chicago Bikeshare](https://chrisluedtke.github.io/divvy-data.html) (Lambda School Data Science student)
- [Using Phoebe for animations in Google Colab](https://colab.research.google.com/github/phoebe-project/phoebe2-docs/blob/2.1/tutorials/animations.ipynb)

## 2. Study for the Sprint Challenge

- Concatenate DataFrames
- Merge DataFrames
- Reshape data with `pivot_table()` and `.melt()`
- Be able to reproduce a FiveThirtyEight graph using Matplotlib or Seaborn.

## 3. Work on anything related to your portfolio site / Data Storytelling Project

In [0]:
# TODO